app/controllers/application_controller.rb

  def current_user
    @user ||=
      begin
        return nil unless session[:user_id]
        User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1