app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: params[:username])
    if @user.present? && @user.authenticate(params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'Mo' LIMIT 1